## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account.logs[0] has changed
  ~ resource "azurerm_storage_account" "logs" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
        name                              = "findatppr379logs"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (37 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "40.84.173.53",
              + "20.57.41.253",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["app"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379applogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.data.azurerm_storage_account_blob_container_sas.logs["http"] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_storage_account_blob_container_sas" "logs" {
      + connection_string = (sensitive value)
      + container_name    = "find-a-tp-pr-379httplogs"
      + expiry            = (known after apply)
      + https_only        = true
      + id                = (known after apply)
      + sas               = (sensitive value)
      + start             = (known after apply)

      + permissions {
          + add    = true
          + create = true
          + delete = true
          + list   = true
          + read   = true
          + write  = true
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_linux_web_app.default[0] will be updated in-place
  ~ resource "azurerm_linux_web_app" "default" {
        id                                = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379"
        name                              = "find-a-tp-pr-379"
        tags                              = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (19 unchanged attributes hidden)

      ~ logs {
            # (2 unchanged attributes hidden)

          ~ application_logs {
                # (1 unchanged attribute hidden)

              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (2 unchanged attributes hidden)
                }
            }

          ~ http_logs {
              ~ azure_blob_storage {
                  ~ sas_url           = (sensitive value)
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (2 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_key_vault[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_key_vault" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.KeyVault/vaults/find-a-tp-pr-379-kv|find-a-tp-pr-379-default-kv-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-default-kv-diag"
        # (2 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.default_redis_cache[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "default_redis_cache" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Cache/redis/find-a-tp-pr-379-redis-cache|find-a-tp-pr-379-default-redis-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-default-redis-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.web_app[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "web_app" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs|find-a-tp-pr-379-storage-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-storage-diag"
        # (2 unchanged attributes hidden)

      - metric {
          - category = "Capacity" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - metric {
          - category = "Transaction" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      + metric {
          + category = "Transaction"
          + enabled  = true

          + retention_policy {
              + enabled = false
            }
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_diagnostic_setting.webhook[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "webhook" {
        id                             = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Logic/workflows/find-a-tp-pr-379-webhook-workflow|find-a-tp-pr-379-webhook-diag"
      + log_analytics_destination_type = "Dedicated"
        name                           = "find-a-tp-pr-379-webhook-diag"
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_metric_alert.web_app_service[0] will be destroyed
  # (because azurerm_monitor_metric_alert.web_app_service is not in configuration)
  - resource "azurerm_monitor_metric_alert" "web_app_service" {
      - auto_mitigate       = true -> null
      - description         = "This alert will trigger when the count of Server Errors (HTTP 5xx) errors exceeds the threshold" -> null
      - enabled             = true -> null
      - frequency           = "PT1M" -> null
      - id                  = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/metricAlerts/find-a-tp-pr-379-webapp-errors" -> null
      - name                = "find-a-tp-pr-379-webapp-errors" -> null
      - resource_group_name = "s177d01-ntp-pr-379" -> null
      - scopes              = [
          - "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Web/sites/find-a-tp-pr-379",
        ] -> null
      - severity            = 3 -> null
      - tags                = {
          - "Environment"      = "Dev"
          - "Product"          = "National Tutoring Programme"
          - "Service Offering" = "National Tutoring Programme"
        } -> null
      - window_size         = "PT5M" -> null

      - action {
          - action_group_id    = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-379-actiongroup" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Count" -> null
          - metric_name            = "Http5xx" -> null
          - metric_namespace       = "Microsoft.Web/sites" -> null
          - operator               = "Equals" -> null
          - skip_metric_validation = false -> null
          - threshold              = 1 -> null
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_monitor_scheduled_query_rules_alert.web_app_service[0] will be created
  + resource "azurerm_monitor_scheduled_query_rules_alert" "web_app_service" {
      + auto_mitigation_enabled = false
      + data_source_id          = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/components/find-a-tp-pr-379-insights"
      + description             = "This rule triggers when there are traces or requests with a result code of 500 or a severity level of 3."
      + enabled                 = true
      + frequency               = 5
      + id                      = (known after apply)
      + location                = "westeurope"
      + name                    = "find-a-tp-pr-379-webapp-errors"
      + query                   = <<-EOT
            traces
            | union requests
            | where resultCode == "500" or severityLevel == 3
            | where timestamp > ago(6m)
            | order by timestamp desc
            | take 1
        EOT
      + query_type              = "ResultCount"
      + resource_group_name     = "s177d01-ntp-pr-379"
      + severity                = 0
      + tags                    = {
          + "Environment"      = "pr-379"
          + "Product"          = "National Tutoring Programme"
          + "Service Offering" = "National Tutoring Programme"
        }
      + time_window             = 10

      + action {
          + action_group = [
              + "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Insights/actionGroups/find-a-tp-pr-379-actiongroup",
            ]
        }

      + trigger {
          + operator  = "GreaterThan"
          + threshold = 1
        }
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_postgresql_flexible_server.default will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "default" {
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ administrator_login           = (sensitive value)
        id                            = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.DBforPostgreSQL/flexibleServers/find-a-tp-pr-379-psqlflexible-server"
        name                          = "find-a-tp-pr-379-psqlflexible-server"
        tags                          = {
            "Environment"      = "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_resource_group.default[0] will be updated in-place
  ~ resource "azurerm_resource_group" "default" {
        id       = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379"
        name     = "s177d01-ntp-pr-379"
      ~ tags     = {
          ~ "Environment"      = "Dev" -> "pr-379"
            "Product"          = "National Tutoring Programme"
            "Service Offering" = "National Tutoring Programme"
        }
        # (1 unchanged attribute hidden)
    }

  # module.fatp_azure_web_app_services_hosting.azurerm_storage_account_network_rules.logs[0] will be updated in-place
  ~ resource "azurerm_storage_account_network_rules" "logs" {
        id                         = "/subscriptions/f5d7dec2-c307-499e-be11-f1e107eadd34/resourceGroups/s177d01-ntp-pr-379/providers/Microsoft.Storage/storageAccounts/findatppr379logs"
      ~ ip_rules                   = [
          - "20.57.41.253",
            # (1 unchanged element hidden)
        ]
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.
```
</details>